<?php
/**************************************************************************/
/******************* 飞信通知天气预报通用版  *********************************/ 
/*************************** 2012-8-4*************************************/
/**************************作者：xiaogg*************************************/ 
/***************************版本：2.2***************************************/ 
/*********************http://www.xiaogg.org********************************/
/********************官方主页http://w.ibtf.net******************************/
extract($_GET);
header("content-Type: text/html; charset=utf-8");
$phone=15999633376;
$pwd="lcin734755";
$to=15889770182;
$msg="所谓睡货，可用八个字概括：春困，夏乏，秋盹，冬眠。。。";
$u=1;
if($u==""){$msg=iconv("gbk","UTF-8",$msg);}//根据空间配置不同如果出现乱码请修改此处或在url上加上参数&u=1
if(!($phone&&$pwd&&$msg)){die('http://w.ibtf.net/f.php?phone=xxxxxx&pwd=xxx&to=xxxx&msg=xxxx');}
if(!$to)$to=$phone;
require 'lib/PHPFetion.php';
$fetion = new PHPFetion($phone, $pwd);	// 手机号、飞信密码
if($fetion->send($to, $msg))// 接收人手机号、飞信内容
{echo "发送成功";}else{echo "发送失败,请重试!";}
?>